{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 186,
   "id": "3ae11285-968d-456e-a894-d852d3509ce1",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from bs4 import BeautifulSoup\n",
    "import pandas as pd\n",
    "import pickle\n",
    "from neo4j import GraphDatabase\n",
    "from neo4j.exceptions import ServiceUnavailable\n",
    "import logging\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "id": "37c6c5f0-437b-4f35-8eef-d537618516af",
   "metadata": {},
   "outputs": [],
   "source": [
    "fbref_url = \"https://fbref.com{}\"\n",
    "premier_league = fbref_url.format(\"/en/comps/9/Premier-League-Stats\")\n",
    "data = requests.get(premier_league)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd10f631-e73e-420c-8414-ce54d5edcdab",
   "metadata": {},
   "source": [
    "# CHANGE DETAILS BELOW FOR PERSONAL INSTANCE WHEN RUNNING "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "c9ca4f71-2288-43e0-a625-ebd03c6a33ec",
   "metadata": {},
   "outputs": [],
   "source": [
    "# alex instance details \n",
    "NEO4J_URI='neo4j+s://14544b1e.databases.Sneo4j.io'\n",
    "NEO4J_USERNAME='neo4j'\n",
    "NEO4J_PASSWORD='DSB0RkgvGa1atsHc5KoiVPst4l95qg_iMADHrRDXmzA'\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 220,
   "id": "88e68e31-6a8c-402e-b95e-b6c1d93a81b9",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "e147463d-5331-47ff-92cd-b79c0a95a24e",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (n)\n",
    "    DETACH DELETE n\n",
    "    \"\"\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "b9c99693-900e-4bba-9e9a-ddd629be52f1",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"CREATE (l:League {name: $name})\"\n",
    "    session.run(query, {\"name\":\"PremierLegue24-25\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "08a464ed-2ffa-4ba9-8fd0-20aae090d971",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(f'team_dict_24-25.pkl', 'rb') as f:\n",
    "        team_dict = pickle.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "32e4030e-8068-40a2-bd95-bfab03876373",
   "metadata": {},
   "outputs": [],
   "source": [
    "team_players = dict()\n",
    "player_details = list()\n",
    "for team, players in team_dict.items():\n",
    "    team_players[team] = list()\n",
    "    for player in players.keys():\n",
    "        team_players[team].append(player)\n",
    "        players[player]['Name'] = player\n",
    "        player_details.append(players[player])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "442650ce-37fe-4eb1-8621-ce12f85a114f",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"\"\"\n",
    "            UNWIND $players AS player\n",
    "            MERGE (p:Player {name: player.Name})\n",
    "            SET p.position = player.position,\n",
    "                p.footed = player.footed,\n",
    "                p.height = player.height,\n",
    "                p.weight = player.weight,\n",
    "                p.dob = player.dob,\n",
    "                p.birth_place = player.birth_place,\n",
    "                p.national_team = player.national_team,\n",
    "                p.club = player.club,\n",
    "                p.wages = player.wages,\n",
    "                p.contract_expiry = player.contract_expiry,\n",
    "                p.img = player.img\n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, players=player_details)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "f1f8e593-a527-4d30-a156-4dd7ade96cc5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# clean up before sending\n",
    "with open('match_reports.pkl','rb') as f:\n",
    "    match_reports = pickle.load(f)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 196,
   "id": "6bc2056e-e5af-469e-9e69-2c084475f91b",
   "metadata": {},
   "outputs": [],
   "source": [
    "fixtures_df = pd.read_csv('fixtures.csv')\n",
    "fixtures_df[['Home_Score', 'Away_Score']] = fixtures_df['Score'].str.split('–', expand=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "id": "c07ddce2-ae6a-4576-bf91-9d634883ee46",
   "metadata": {},
   "outputs": [],
   "source": [
    "all_players_dict = pd.read_csv('all_players.csv', index_col=0).to_dict(orient='index')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "id": "b59b147e-091a-4db1-8a41-80eb277b892e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# this is very important please do not delete\n",
    "mappings = {\"Brighton\":'Brighton & Hove Albion',\n",
    "            'Manchester Utd':'Manchester United',\n",
    "            'Newcastle Utd':'Newcastle United',\n",
    "            \"Nott'ham Forest\":'Nottingham Forest',\n",
    "            'Tottenham':'Tottenham Hotspur',\n",
    "            'West Ham':'West Ham United',\n",
    "            'Wolves':'Wolverhampton Wanderers'}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "43cb6f30-7b39-4fdc-acc4-d5d14257565a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# fixtures_df['Home'] = fixtures_df['Home'].map(mappings)\n",
    "# fixtures_df['Away'] = fixtures_df['Away'].map(mappings)\n",
    "fixtures_df['Home'] = fixtures_df['Home'].apply(lambda x: mappings[x] if x in mappings else x)\n",
    "fixtures_df['Away'] = fixtures_df['Away'].apply(lambda x: mappings[x] if x in mappings else x)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "1ef7e98c-de16-45dc-a601-5be615080ef1",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"match (n) detach delete n\"\n",
    "    session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "2749bb8f-ae5b-4152-afae-1d45c3e20e35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x15ed019a0>\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"CREATE (l:League {name: $name})\"\n",
    "    session.run(query, {\"name\":\"PremierLeague\"})\n",
    "\n",
    "    query = \"CREATE (s:Season {name: $name})\"\n",
    "    session.run(query, {\"name\":\"24-25\"})\n",
    "\n",
    "    query = \"\"\"\n",
    "        MATCH (s:Season{name:$season_name}), (l:League{name: $league_name}) \n",
    "        CREATE (s)-[:SEASON_OF_LEAGUE]->(l)\n",
    "        \"\"\"\n",
    "    print(session.run(query, {\"league_name\": \"PremierLeague\", \"season_name\": \"24-25\"}))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "id": "828586b2-092c-43cf-95f0-83a98d6014ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "team_players = dict()\n",
    "player_details = list()\n",
    "\n",
    "for team, players in team_dict.items():\n",
    "    team_players[team] = list()\n",
    "    for player in players.keys():\n",
    "        team_players[team].append(player)\n",
    "        players[player]['Name'] = player\n",
    "        players[player]['Team'] = team  # Fix the key access from player to players\n",
    "        player_details.append(players[player])\n",
    "    team_players[team] = team_players[team]\n",
    "\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"\"\"\n",
    "            UNWIND $players AS player\n",
    "            MERGE (p:Player {name: player.Name})\n",
    "            SET p.position = player.position,\n",
    "                p.footed = player.footed,\n",
    "                p.height = player.height,\n",
    "                p.weight = player.weight,\n",
    "                p.dob = player.dob,\n",
    "                p.birth_place = player.birth_place,\n",
    "                p.national_team = player.national_team,\n",
    "                p.club = player.club,\n",
    "                p.wages = player.wages,\n",
    "                p.contract_expiry = player.contract_expiry,\n",
    "                p.img = player.img\n",
    "\n",
    "            MERGE (team:Team {name: player.Team})\n",
    "            MERGE (p)-[:PLAYS_FOR]->(team)\n",
    "    \"\"\"\n",
    "    \n",
    "    session.run(query, players=player_details)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "id": "135eb3d7-e4b8-4763-8267-e879ae01b7bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    # Create GameWeek nodes and relationships\n",
    "    for gw in range(1, 39):  # Loop from 1 to 38\n",
    "        query = \"\"\"\n",
    "        MATCH (s:Season {name: $season_name})\n",
    "        CREATE (gw:GameWeek {number: $number})-[:IS_A_GW]->(s)\n",
    "        \"\"\"\n",
    "        session.run(query, {\"season_name\": \"24-25\", \"number\": gw})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "id": "939945ba-baaa-4e6a-a25b-9c1ab06d50f4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unnamed: 0        0\n",
      "GW                0\n",
      "Day               0\n",
      "Date              0\n",
      "Time              0\n",
      "Home              0\n",
      "xG              173\n",
      "Score           173\n",
      "xG.1            173\n",
      "Away              0\n",
      "Attendance      173\n",
      "Venue             0\n",
      "Referee         173\n",
      "Match Report      0\n",
      "Notes           380\n",
      "Home_Score      173\n",
      "Away_Score      173\n",
      "dtype: int64\n"
     ]
    }
   ],
   "source": [
    "print(fixtures_df.isna().sum())\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "id": "8cd5fd17-60b9-450d-859b-addf6225ad45",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    for _, row in fixtures_df.iterrows():\n",
    "        query = \"\"\"\n",
    "        MERGE (match:Match {id: $match_id})\n",
    "        SET match.date = $date,\n",
    "            match.time = $time,\n",
    "            match.home_team = $home_team,\n",
    "            match.away_team = $away_team,\n",
    "            match.home_expected = $home_expected,\n",
    "            match.away_expected = $away_expected,\n",
    "            match.home_score = $home_score,\n",
    "            match.away_score = $away_score\n",
    "\n",
    "        MERGE (ref:Referee {name: $referee})\n",
    "        MERGE (venue:Venue {name: $venue})\n",
    "        \n",
    "        MERGE (home_team:Team {name: $home_team})\n",
    "        MERGE (away_team:Team {name: $away_team})\n",
    "        \n",
    "        MERGE (match)-[:REFERRED_BY]->(ref)\n",
    "        MERGE (match)-[:PLAYED_AT]->(venue)\n",
    "        MERGE (match)-[:HOME_TEAM]->(home_team)\n",
    "        MERGE (match)-[:AWAY_TEAM]->(away_team)\n",
    "        \"\"\"\n",
    "        \n",
    "        # Prepare the data dictionary\n",
    "        data ={\n",
    "            \"match_id\": f\"GW{row['GW']}_{row['Home']}_vs_{row['Away']}\",\n",
    "            \"date\": row[\"Date\"],\n",
    "            \"time\": row[\"Time\"],\n",
    "            \"home_team\": row[\"Home\"],\n",
    "            \"away_team\": row[\"Away\"],\n",
    "        }\n",
    "        if row[\"Match Report\"]:\n",
    "            data[\"home_expected\"]= row[\"xG\"],\n",
    "            data[\"away_expected\"]= row[\"xG.1\"],\n",
    "            data[\"home_score\"]= row[\"Home_Score\"],\n",
    "            data[\"away_score\"]= row[\"Away_Score\"],\n",
    "            data[\"referee\"]= row[\"Referee\"],\n",
    "            data[\"venue\"] =  row[\"Venue\"]\n",
    "        \n",
    "        # Execute the query\n",
    "        session.run(query, data)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 206,
   "id": "bf7eb071-83f8-413a-a9ae-034be6b61adb",
   "metadata": {},
   "outputs": [],
   "source": [
    "with driver.session(database=\"neo4j\") as session:\n",
    "    for i, row in fixtures_df[:len(match_reports)].iterrows():\n",
    "        match_id = f\"GW{row['GW']}_{row['Home']}_vs_{row['Away']}\"\n",
    "\n",
    "\n",
    "        home_team_stats = match_reports[i][0][0][:-1] \n",
    "        away_team_stats = match_reports[i][1][0][:-1] \n",
    "        home_team_goaly_stats = match_reports[i][0][1] \n",
    "        away_team_goaly_stats = match_reports[i][1][1]\n",
    "\n",
    "        home_team_name = row['Home']\n",
    "        away_team_name = row['Away']\n",
    "\n",
    "\n",
    "        # Add Home Team Player Stats\n",
    "        for _, player_stats in home_team_stats.iterrows():\n",
    "            player_query = \"\"\"\n",
    "            MERGE (player:Player {name: $player_name, nation: $nation, position: $position, age: $age})\n",
    "            MERGE (team:Team {name: $team_name})\n",
    "            MERGE (player)-[:PLAYS_FOR]->(team)\n",
    "            MERGE (match:Match {id: $match_id})\n",
    "            MERGE (match)-[h:HOME_TEAM_PLAYER_STATS]->(player)\n",
    "            SET h.goals = $goals,\n",
    "                h.assists = $assists,\n",
    "                h.penalties = $penalties,\n",
    "                h.shots = $shots,\n",
    "                h.shots_on_target = $shots_on_target,\n",
    "                h.touches = $touches,\n",
    "                h.tackles = $tackles,\n",
    "                h.interceptions = $interceptions,\n",
    "                h.blocks = $blocks,\n",
    "                h.xg = $xg,\n",
    "                h.npxg = $npxg,\n",
    "                h.xag = $xag,\n",
    "                h.sca = $sca,\n",
    "                h.gca = $gca,\n",
    "                h.passes_completed = $passes_completed,\n",
    "                h.passes_attempted = $passes_attempted,\n",
    "                h.pass_accuracy = $pass_accuracy,\n",
    "                h.progressive_passes = $progressive_passes,\n",
    "                h.carries = $carries,\n",
    "                h.progressive_carries = $progressive_carries\n",
    "            \"\"\"\n",
    "            session.run(player_query, {\n",
    "                \"player_name\": player_stats[('Unnamed: 0_level_0', 'Player')],\n",
    "                \"nation\": player_stats[('Unnamed: 2_level_0', 'Nation')],\n",
    "                \"position\": player_stats[('Unnamed: 3_level_0', 'Pos')],\n",
    "                \"age\": player_stats[('Unnamed: 4_level_0', 'Age')],\n",
    "                \"match_id\": match_id,\n",
    "                \"team_name\": home_team_name,\n",
    "                \"goals\": player_stats[('Performance', 'Gls')],\n",
    "                \"assists\": player_stats[('Performance', 'Ast')],\n",
    "                \"penalties\": player_stats[('Performance', 'PK')],\n",
    "                \"shots\": player_stats[('Performance', 'Sh')],\n",
    "                \"shots_on_target\": player_stats[('Performance', 'SoT')],\n",
    "                \"touches\": player_stats[('Performance', 'Touches')],\n",
    "                \"tackles\": player_stats[('Performance', 'Tkl')],\n",
    "                \"interceptions\": player_stats[('Performance', 'Int')],\n",
    "                \"blocks\": player_stats[('Performance', 'Blocks')],\n",
    "                \"xg\": player_stats[('Expected', 'xG')],\n",
    "                \"npxg\": player_stats[('Expected', 'npxG')],\n",
    "                \"xag\": player_stats[('Expected', 'xAG')],\n",
    "                \"sca\": player_stats[('SCA', 'SCA')],\n",
    "                \"gca\": player_stats[('SCA', 'GCA')],\n",
    "                \"passes_completed\": player_stats[('Passes', 'Cmp')],\n",
    "                \"passes_attempted\": player_stats[('Passes', 'Att')],\n",
    "                \"pass_accuracy\": player_stats[('Passes', 'Cmp%')],\n",
    "                \"progressive_passes\": player_stats[('Passes', 'PrgP')],\n",
    "                \"carries\": player_stats[('Carries', 'Carries')],\n",
    "                \"progressive_carries\": player_stats[('Carries', 'PrgC')],\n",
    "            })\n",
    "\n",
    "        # Add Away Team Player Stats\n",
    "        for _, player_stats in away_team_stats.iterrows():\n",
    "            player_query = \"\"\"\n",
    "            MERGE (player:Player {name: $player_name, nation: $nation, position: $position, age: $age})\n",
    "            MERGE (team:Team {name: $team_name})\n",
    "            MERGE (player)-[:PLAYS_FOR]->(team)\n",
    "            MERGE (match:Match {id: $match_id})\n",
    "            MERGE (match)-[a:AWAY_TEAM_PLAYER_STATS]->(player)\n",
    "            SET a.goals = $goals,\n",
    "                a.assists = $assists,\n",
    "                a.penalties = $penalties,\n",
    "                a.shots = $shots,\n",
    "                a.shots_on_target = $shots_on_target,\n",
    "                a.touches = $touches,\n",
    "                a.tackles = $tackles,\n",
    "                a.interceptions = $interceptions,\n",
    "                a.blocks = $blocks,\n",
    "                a.xg = $xg,\n",
    "                a.npxg = $npxg,\n",
    "                a.xag = $xag,\n",
    "                a.sca = $sca,\n",
    "                a.gca = $gca,\n",
    "                a.passes_completed = $passes_completed,\n",
    "                a.passes_attempted = $passes_attempted,\n",
    "                a.pass_accuracy = $pass_accuracy,\n",
    "                a.progressive_passes = $progressive_passes,\n",
    "                a.carries = $carries,\n",
    "                a.progressive_carries = $progressive_carries\n",
    "            \"\"\"\n",
    "            session.run(player_query, {\n",
    "                \"player_name\": player_stats[('Unnamed: 0_level_0', 'Player')],\n",
    "                \"nation\": player_stats[('Unnamed: 2_level_0', 'Nation')],\n",
    "                \"position\": player_stats[('Unnamed: 3_level_0', 'Pos')],\n",
    "                \"age\": player_stats[('Unnamed: 4_level_0', 'Age')],\n",
    "                \"match_id\": match_id,\n",
    "                \"team_name\": away_team_name,\n",
    "                \"goals\": player_stats[('Performance', 'Gls')],\n",
    "                \"assists\": player_stats[('Performance', 'Ast')],\n",
    "                \"penalties\": player_stats[('Performance', 'PK')],\n",
    "                \"shots\": player_stats[('Performance', 'Sh')],\n",
    "                \"shots_on_target\": player_stats[('Performance', 'SoT')],\n",
    "                \"touches\": player_stats[('Performance', 'Touches')],\n",
    "                \"tackles\": player_stats[('Performance', 'Tkl')],\n",
    "                \"interceptions\": player_stats[('Performance', 'Int')],\n",
    "                \"blocks\": player_stats[('Performance', 'Blocks')],\n",
    "                \"xg\": player_stats[('Expected', 'xG')],\n",
    "                \"npxg\": player_stats[('Expected', 'npxG')],\n",
    "                \"xag\": player_stats[('Expected', 'xAG')],\n",
    "                \"sca\": player_stats[('SCA', 'SCA')],\n",
    "                \"gca\": player_stats[('SCA', 'GCA')],\n",
    "                \"passes_completed\": player_stats[('Passes', 'Cmp')],\n",
    "                \"passes_attempted\": player_stats[('Passes', 'Att')],\n",
    "                \"pass_accuracy\": player_stats[('Passes', 'Cmp%')],\n",
    "                \"progressive_passes\": player_stats[('Passes', 'PrgP')],\n",
    "                \"carries\": player_stats[('Carries', 'Carries')],\n",
    "                \"progressive_carries\": player_stats[('Carries', 'PrgC')],\n",
    "            })\n",
    "\n",
    "         # Add Home Team Goalie Stats\n",
    "        for _, goalie_stats in home_team_goaly_stats.iterrows():\n",
    "            goalie_query = \"\"\"\n",
    "            MERGE (goalie:Player {name: $goalie_name, nation: $nation, position: \"GK\", age: $age})\n",
    "            MERGE (team:Team {name: $team_name})\n",
    "            MERGE (goalie)-[:PLAYS_FOR]->(team)\n",
    "            MERGE (match:Match {id: $match_id})\n",
    "            MERGE (match)-[:HOME_TEAM_GOALIE_STATS]->(goalie)\n",
    "            SET goalie.minutes_played = $minutes_played,\n",
    "                goalie.sota = $sota,\n",
    "                goalie.goals_allowed = $goals_allowed,\n",
    "                goalie.saves = $saves,\n",
    "                goalie.save_percentage = $save_percentage,\n",
    "                goalie.psxg = $psxg,\n",
    "                goalie.passes_completed = $passes_completed,\n",
    "                goalie.passes_attempted = $passes_attempted,\n",
    "                goalie.pass_accuracy = $pass_accuracy,\n",
    "                goalie.gk_passes_attempted = $gk_passes_attempted,\n",
    "                goalie.throws = $throws,\n",
    "                goalie.launch_percentage = $launch_percentage,\n",
    "                goalie.launch_average_length = $launch_average_length,\n",
    "                goalie.goal_kicks_attempted = $goal_kicks_attempted,\n",
    "                goalie.goal_kick_launch_percentage = $goal_kick_launch_percentage,\n",
    "                goalie.goal_kick_average_length = $goal_kick_average_length,\n",
    "                goalie.crosses_opportunities = $crosses_opportunities,\n",
    "                goalie.crosses_stops = $crosses_stops,\n",
    "                goalie.crosses_stop_percentage = $crosses_stop_percentage,\n",
    "                goalie.opa = $opa,\n",
    "                goalie.opa_average_distance = $opa_average_distance\n",
    "            \"\"\"\n",
    "            session.run(goalie_query, {\n",
    "                \"goalie_name\": goalie_stats[('Unnamed: 0_level_0', 'Player')],\n",
    "                \"nation\": goalie_stats[('Unnamed: 1_level_0', 'Nation')],\n",
    "                \"age\": goalie_stats[('Unnamed: 2_level_0', 'Age')],\n",
    "                \"match_id\": match_id,\n",
    "                \"team_name\": home_team_name,\n",
    "                \"minutes_played\": goalie_stats[('Unnamed: 3_level_0', 'Min')],\n",
    "                \"sota\": goalie_stats[('Shot Stopping', 'SoTA')],\n",
    "                \"goals_allowed\": goalie_stats[('Shot Stopping', 'GA')],\n",
    "                \"saves\": goalie_stats[('Shot Stopping', 'Saves')],\n",
    "                \"save_percentage\": goalie_stats[('Shot Stopping', 'Save%')],\n",
    "                \"psxg\": goalie_stats[('Shot Stopping', 'PSxG')],\n",
    "                \"passes_completed\": goalie_stats[('Launched', 'Cmp')],\n",
    "                \"passes_attempted\": goalie_stats[('Launched', 'Att')],\n",
    "                \"pass_accuracy\": goalie_stats[('Launched', 'Cmp%')],\n",
    "                \"gk_passes_attempted\": goalie_stats[('Passes', 'Att (GK)')],\n",
    "                \"throws\": goalie_stats[('Passes', 'Thr')],\n",
    "                \"launch_percentage\": goalie_stats[('Passes', 'Launch%')],\n",
    "                \"launch_average_length\": goalie_stats[('Passes', 'AvgLen')],\n",
    "                \"goal_kicks_attempted\": goalie_stats[('Goal Kicks', 'Att')],\n",
    "                \"goal_kick_launch_percentage\": goalie_stats[('Goal Kicks', 'Launch%')],\n",
    "                \"goal_kick_average_length\": goalie_stats[('Goal Kicks', 'AvgLen')],\n",
    "                \"crosses_opportunities\": goalie_stats[('Crosses', 'Opp')],\n",
    "                \"crosses_stops\": goalie_stats[('Crosses', 'Stp')],\n",
    "                \"crosses_stop_percentage\": goalie_stats[('Crosses', 'Stp%')],\n",
    "                \"opa\": goalie_stats[('Sweeper', '#OPA')],\n",
    "                \"opa_average_distance\": goalie_stats[('Sweeper', 'AvgDist')],\n",
    "            })\n",
    "\n",
    "        # Add Away Team Goalie Stats\n",
    "        for _, goalie_stats in away_team_goaly_stats.iterrows():\n",
    "            session.run(goalie_query, {\n",
    "                \"goalie_name\": goalie_stats[('Unnamed: 0_level_0', 'Player')],\n",
    "                \"nation\": goalie_stats[('Unnamed: 1_level_0', 'Nation')],\n",
    "                \"age\": goalie_stats[('Unnamed: 2_level_0', 'Age')],\n",
    "                \"match_id\": match_id,\n",
    "                \"team_name\": away_team_name,\n",
    "                \"minutes_played\": goalie_stats[('Unnamed: 3_level_0', 'Min')],\n",
    "                \"sota\": goalie_stats[('Shot Stopping', 'SoTA')],\n",
    "                \"goals_allowed\": goalie_stats[('Shot Stopping', 'GA')],\n",
    "                \"saves\": goalie_stats[('Shot Stopping', 'Saves')],\n",
    "                \"save_percentage\": goalie_stats[('Shot Stopping', 'Save%')],\n",
    "                \"psxg\": goalie_stats[('Shot Stopping', 'PSxG')],\n",
    "                \"passes_completed\": goalie_stats[('Launched', 'Cmp')],\n",
    "                \"passes_attempted\": goalie_stats[('Launched', 'Att')],\n",
    "                \"pass_accuracy\": goalie_stats[('Launched', 'Cmp%')],\n",
    "                \"gk_passes_attempted\": goalie_stats[('Passes', 'Att (GK)')],\n",
    "                \"throws\": goalie_stats[('Passes', 'Thr')],\n",
    "                \"launch_percentage\": goalie_stats[('Passes', 'Launch%')],\n",
    "                \"launch_average_length\": goalie_stats[('Passes', 'AvgLen')],\n",
    "                \"goal_kicks_attempted\": goalie_stats[('Goal Kicks', 'Att')],\n",
    "                \"goal_kick_launch_percentage\": goalie_stats[('Goal Kicks', 'Launch%')],\n",
    "                \"goal_kick_average_length\": goalie_stats[('Goal Kicks', 'AvgLen')],\n",
    "                \"crosses_opportunities\": goalie_stats[('Crosses', 'Opp')],\n",
    "                \"crosses_stops\": goalie_stats[('Crosses', 'Stp')],\n",
    "                \"crosses_stop_percentage\": goalie_stats[('Crosses', 'Stp%')],\n",
    "                \"opa\": goalie_stats[('Sweeper', '#OPA')],\n",
    "                \"opa_average_distance\": goalie_stats[('Sweeper', 'AvgDist')],\n",
    "            })\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "id": "84c347b0-2607-4524-975d-c9fceab7fce7",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (player:Player)-[:PLAYS_FOR]->(team:Team)\n",
    "WITH player, COUNT(team) AS teamCount\n",
    "WHERE teamCount > 3\n",
    "RETURN player, teamCount\n",
    "\"\"\"\n",
    "players_errors = list()\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    r = session.run(query)\n",
    "    for record in r:\n",
    "        players_errors.append(record[\"player\"][\"name\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 224,
   "id": "ff9f740a-1b89-42d6-b579-2af8533a0c20",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record match_id='GWGW12_Newcastle United_vs_West Ham United' m.date='2024-11-25' m.home_team='Newcastle United' m.away_team='West Ham United' player_stats={'assists': 0, 'tackles': 1, 'touches': 2, 'passes_completed': 2, 'blocks': 0, 'penalties': 0, 'pass_accuracy': 100.0, 'shots_on_target': 0, 'goals': 0, 'gca': 0, 'sca': 0, 'progressive_carries': 0, 'interceptions': 0, 'progressive_passes': 0, 'npxg': 0.0, 'xag': 0.0, 'carries': 3, 'shots': 0, 'xg': 0.0, 'passes_attempted': 2}>\n",
      "<Record match_id='GWGW13_Crystal Palace_vs_Newcastle United' m.date='2024-11-30' m.home_team='Crystal Palace' m.away_team='Newcastle United' player_stats={'assists': 0, 'tackles': 0, 'touches': 6, 'passes_completed': 2, 'blocks': 0, 'penalties': 0, 'pass_accuracy': 66.7, 'shots_on_target': 0, 'goals': 0, 'gca': 0, 'sca': 0, 'progressive_carries': 0, 'interceptions': 0, 'progressive_passes': 0, 'npxg': 0.0, 'xag': 0.0, 'carries': 6, 'shots': 0, 'xg': 0.0, 'passes_attempted': 3}>\n",
      "<Record match_id='GWGW14_Newcastle United_vs_Liverpool' m.date='2024-12-04' m.home_team='Newcastle United' m.away_team='Liverpool' player_stats={'assists': 0, 'tackles': 0, 'touches': 1, 'passes_completed': 0, 'blocks': 0, 'penalties': 0, 'pass_accuracy': nan, 'shots_on_target': 0, 'goals': 0, 'gca': 0, 'sca': 1, 'progressive_carries': 0, 'interceptions': 0, 'progressive_passes': 0, 'npxg': 0.0, 'xag': 0.0, 'carries': 1, 'shots': 0, 'xg': 0.0, 'passes_attempted': 0}>\n",
      "<Record match_id='GWGW15_Brentford_vs_Newcastle United' m.date='2024-12-07' m.home_team='Brentford' m.away_team='Newcastle United' player_stats={'assists': 0, 'tackles': 0, 'touches': 6, 'passes_completed': 2, 'blocks': 0, 'penalties': 0, 'pass_accuracy': 66.7, 'shots_on_target': 0, 'goals': 0, 'gca': 0, 'sca': 0, 'progressive_carries': 0, 'interceptions': 0, 'progressive_passes': 0, 'npxg': 0.0, 'xag': 0.0, 'carries': 2, 'shots': 0, 'xg': 0.0, 'passes_attempted': 3}>\n",
      "4\n"
     ]
    }
   ],
   "source": [
    "# find match info they DID play in\n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (player:Player {name: \"Callum Wilson\"})\n",
    "    MATCH (player)-[:PLAYS_FOR]-(team:Team {name: \"Newcastle United\"})\n",
    "    MATCH (team)-[:HOME_TEAM|AWAY_TEAM]-(m:Match)\n",
    "    MATCH (player)-[stats:HOME_TEAM_PLAYER_STATS|AWAY_TEAM_PLAYER_STATS]-(m)\n",
    "    RETURN DISTINCT \n",
    "      m.id AS match_id, \n",
    "      m.date, \n",
    "      m.home_team, \n",
    "      m.away_team,\n",
    "      properties(stats) AS player_stats\n",
    "          \"\"\"\n",
    "\n",
    "    result = session.run(query)\n",
    "    count=0\n",
    "    for r in result:\n",
    "        print(r)\n",
    "        count +=1\n",
    "    print(count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 228,
   "id": "0f70bb3f-ac23-4a3e-a3e6-b03faea4c4a6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record match_id='GWGW1_Newcastle United_vs_Southampton' m.date='2024-08-17' m.home_team='Newcastle United' m.away_team='Southampton' m.away_score=['0'] m.home_score=['1']>\n",
      "<Record match_id='GWGW3_Newcastle United_vs_Tottenham Hotspur' m.date='2024-09-01' m.home_team='Newcastle United' m.away_team='Tottenham Hotspur' m.away_score=['1'] m.home_score=['2']>\n",
      "<Record match_id='GWGW6_Newcastle United_vs_Manchester City' m.date='2024-09-28' m.home_team='Newcastle United' m.away_team='Manchester City' m.away_score=['1'] m.home_score=['1']>\n",
      "<Record match_id='GWGW8_Newcastle United_vs_Brighton & Hove Albion' m.date='2024-10-19' m.home_team='Newcastle United' m.away_team='Brighton & Hove Albion' m.away_score=['1'] m.home_score=['0']>\n",
      "<Record match_id='GWGW10_Newcastle United_vs_Arsenal' m.date='2024-11-02' m.home_team='Newcastle United' m.away_team='Arsenal' m.away_score=['0'] m.home_score=['1']>\n",
      "<Record match_id='GWGW16_Newcastle United_vs_Leicester City' m.date='2024-12-14' m.home_team='Newcastle United' m.away_team='Leicester City' m.away_score=['0'] m.home_score=['4']>\n",
      "<Record match_id='GWGW18_Newcastle United_vs_Aston Villa' m.date='2024-12-26' m.home_team='Newcastle United' m.away_team='Aston Villa' m.away_score=['0'] m.home_score=['3']>\n",
      "<Record match_id='GWGW21_Newcastle United_vs_Wolverhampton Wanderers' m.date='2025-01-15' m.home_team='Newcastle United' m.away_team='Wolverhampton Wanderers' m.away_score=['0'] m.home_score=['3']>\n",
      "<Record match_id='GWGW22_Newcastle United_vs_Bournemouth' m.date='2025-01-18' m.home_team='Newcastle United' m.away_team='Bournemouth' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW24_Newcastle United_vs_Fulham' m.date='2025-02-01' m.home_team='Newcastle United' m.away_team='Fulham' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW26_Newcastle United_vs_Nottingham Forest' m.date='2025-02-23' m.home_team='Newcastle United' m.away_team='Nottingham Forest' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW29_Newcastle United_vs_Crystal Palace' m.date='2025-03-15' m.home_team='Newcastle United' m.away_team='Crystal Palace' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW30_Newcastle United_vs_Brentford' m.date='2025-04-02' m.home_team='Newcastle United' m.away_team='Brentford' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW32_Newcastle United_vs_Manchester United' m.date='2025-04-12' m.home_team='Newcastle United' m.away_team='Manchester United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW34_Newcastle United_vs_Ipswich Town' m.date='2025-04-26' m.home_team='Newcastle United' m.away_team='Ipswich Town' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW36_Newcastle United_vs_Chelsea' m.date='2025-05-10' m.home_team='Newcastle United' m.away_team='Chelsea' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW38_Newcastle United_vs_Everton' m.date='2025-05-25' m.home_team='Newcastle United' m.away_team='Everton' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW2_Bournemouth_vs_Newcastle United' m.date='2024-08-25' m.home_team='Bournemouth' m.away_team='Newcastle United' m.away_score=['1'] m.home_score=['1']>\n",
      "<Record match_id='GWGW4_Wolverhampton Wanderers_vs_Newcastle United' m.date='2024-09-15' m.home_team='Wolverhampton Wanderers' m.away_team='Newcastle United' m.away_score=['2'] m.home_score=['1']>\n",
      "<Record match_id='GWGW5_Fulham_vs_Newcastle United' m.date='2024-09-21' m.home_team='Fulham' m.away_team='Newcastle United' m.away_score=['1'] m.home_score=['3']>\n",
      "<Record match_id='GWGW7_Everton_vs_Newcastle United' m.date='2024-10-05' m.home_team='Everton' m.away_team='Newcastle United' m.away_score=['0'] m.home_score=['0']>\n",
      "<Record match_id='GWGW9_Chelsea_vs_Newcastle United' m.date='2024-10-27' m.home_team='Chelsea' m.away_team='Newcastle United' m.away_score=['1'] m.home_score=['2']>\n",
      "<Record match_id='GWGW11_Nottingham Forest_vs_Newcastle United' m.date='2024-11-10' m.home_team='Nottingham Forest' m.away_team='Newcastle United' m.away_score=['3'] m.home_score=['1']>\n",
      "<Record match_id='GWGW17_Ipswich Town_vs_Newcastle United' m.date='2024-12-21' m.home_team='Ipswich Town' m.away_team='Newcastle United' m.away_score=['4'] m.home_score=['0']>\n",
      "<Record match_id='GWGW19_Manchester United_vs_Newcastle United' m.date='2024-12-30' m.home_team='Manchester United' m.away_team='Newcastle United' m.away_score=['2'] m.home_score=['0']>\n",
      "<Record match_id='GWGW20_Tottenham Hotspur_vs_Newcastle United' m.date='2025-01-04' m.home_team='Tottenham Hotspur' m.away_team='Newcastle United' m.away_score=['2'] m.home_score=['1']>\n",
      "<Record match_id='GWGW23_Southampton_vs_Newcastle United' m.date='2025-01-25' m.home_team='Southampton' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW25_Manchester City_vs_Newcastle United' m.date='2025-02-15' m.home_team='Manchester City' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW27_Liverpool_vs_Newcastle United' m.date='2025-02-26' m.home_team='Liverpool' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW28_West Ham United_vs_Newcastle United' m.date='2025-03-08' m.home_team='West Ham United' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW31_Leicester City_vs_Newcastle United' m.date='2025-04-05' m.home_team='Leicester City' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW33_Aston Villa_vs_Newcastle United' m.date='2025-04-19' m.home_team='Aston Villa' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW35_Brighton & Hove Albion_vs_Newcastle United' m.date='2025-05-03' m.home_team='Brighton & Hove Albion' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "<Record match_id='GWGW37_Arsenal_vs_Newcastle United' m.date='2025-05-18' m.home_team='Arsenal' m.away_team='Newcastle United' m.away_score=[nan] m.home_score=[nan]>\n",
      "34\n"
     ]
    }
   ],
   "source": [
    "# find match info they DID NOT play in \n",
    "with driver.session(database=\"neo4j\") as session:\n",
    "    query = \"\"\"\n",
    "    MATCH (team:Team {name: \"Newcastle United\"})\n",
    "    MATCH (team)-[:HOME_TEAM|AWAY_TEAM]-(m:Match)\n",
    "    WHERE NOT (m)-[:HOME_TEAM_PLAYER_STATS|AWAY_TEAM_PLAYER_STATS]-(:Player {name: \"Callum Wilson\"})\n",
    "    RETURN DISTINCT \n",
    "    m.id AS match_id, \n",
    "    m.date, \n",
    "    m.home_team, \n",
    "    m.away_team,\n",
    "    m.away_score,\n",
    "    m.home_score\n",
    "    \"\"\"\n",
    "    result = session.run(query, {\"player_name\": player_name})\n",
    "    count=0\n",
    "    for r in result:\n",
    "        print(r)\n",
    "        count +=1\n",
    "    print(count)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2bc7c4cf-86b3-4e43-9c9d-20a5fe251fb8",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
